{
  "header": {
    "movies": "أفلام",
    "tvSeries": "مسلسلات تلفزيونية",
    "nowRelease": "إصدارات جديدة",
    "searchPlaceholder": "البحث عن أفلام ومسلسلات...",
    "allMovies": "جميع الأفلام",
    "moviesDisponible": "الأفلام المتاحة",
    "allSeries": "جميع المسلسلات",
    "seriesDisponible": "المسلسلات المتاحة",
    "watchlist": "قائمة المشاهدة",
    "profile": "الملف الشخصي",
    "watchHistory": "سجل المشاهدة",
    "recommendations": "توصيات",
    "settings": "الإعدادات",
    "logout": "تسجيل الخروج",
    "login": "تسجيل الدخول",
    "signup": "إنشاء حساب",
    "language": "اللغة"
  },
  "footer": {
    "quickLinks": "روابط سريعة",
    "movies": "أفلام",
    "tvSeries": "مسلسلات تلفزيونية",
    "newReleases": "إصدارات جديدة",
    "support": "الدعم",
    "helpCenter": "مركز المساعدة",
    "termsOfService": "شروط الخدمة",
    "privacyPolicy": "سياسة الخصوصية",
    "connectWithUs": "تواصل معنا",
    "copyright": "© {{year}} MKTV. جميع الحقوق محفوظة."
  },
  "home": {
    "welcomeTitle": "مرحباً بك في MKTV",
    "welcomeSubtitle": "اكتشف وشاهد أفلامك المفضلة بجودة HD.",
    "noTrendingMovies": "لا توجد أفلام رائجة لعرضها حالياً.",
    "watchNowButton": "شاهد الآن",
    "viewDetailsButton": "عرض التفاصيل",
    "whyChooseTitle": "لماذا تختار MKTV؟",
    "whyChooseSubtitle": "استمتع بأفضل منصة بث مع ميزاتنا المتميزة",
    "feature1Title": "جودة عالية الدقة",
    "feature1Description": "شاهد أفلامك وعروضك المفضلة بجودة HD مذهلة",
    "feature2Title": "قابل للتخصيص",
    "feature2Description": "خصص تجربة المشاهدة الخاصة بك بإعداداتنا المتقدمة",
    "feature3Title": "آمن",
    "feature3Description": "بياناتك محمية بإجراءات الأمان المتقدمة لدينا",
    "popularMoviesTitle": "الأفلام الشائعة",
    "popularSeriesTitle": "المسلسلات التلفزيونية الشائعة"
  },
  "moviesAvailable": {
    "title": "الأفلام المتاحة",
    "loading": "جارٍ التحميل...",
    "errorLoadingMovies": "خطأ أثناء تحميل الأفلام المتاحة (Firestore).",
    "noMovies": "لا توجد أفلام متاحة حالياً."
  },
  "supportPages": {
    "helpCenter": {
      "title": "مركز المساعدة",
      "description": "مرحباً بك في مركز المساعدة. هنا يمكنك العثور على إجابات للأسئلة الشائعة والحصول على الدعم.",
      "gettingStartedTitle": "البدء",
      "gettingStartedContent": "اكتشف كيفية التسجيل بسهولة، وتسجيل الدخول، والانغماس في أفلامك ومسلسلاتك التلفزيونية المفضلة. ستساعدك أدلتنا خطوة بخطوة على الإعداد في وقت قصير، مما يضمن بداية سلسة لرحلة المشاهدة الخاصة بك.",
      "troubleshootingTitle": "استكشاف المشكلات الشائعة",
      "troubleshootingContent": "هل تواجه مشكلة؟ يقدم قسم استكشاف الأخطاء وإصلاحها حلولاً للمشكلات الشائعة مثل أخطاء تشغيل الفيديو، وصعوبات الوصول إلى الحساب، ومشكلات الاتصال. ابحث عن حلول سريعة ونصائح للعودة إلى المشاهدة دون انقطاع.",
      "contactSupportTitle": "الاتصال بالدعم",
      "contactSupportContent": "إذا لم تجد الإجابة التي تبحث عنها، فإن فريق الدعم المخصص لدينا هنا للمساعدة. تواصل معنا عبر نموذج الاتصال الخاص بنا للحصول على مساعدة شخصية بشأن أي أسئلة أو مخاوف قد تكون لديك."
    },
    "termsOfService": {
      "title": "شروط الخدمة",
      "description": "يرجى قراءة شروط الخدمة هذه بعناية قبل استخدام خدمتنا. من خلال الوصول إلى الخدمة أو استخدامها، فإنك توافق على الالتزام بهذه الشروط.",
      "acceptanceTitle": "1. قبول الشروط",
      "acceptanceContent": "عبر الوصول إلى خدمة MKTV (الـ \"خدمة\") أو استخدامها، فإنك تقر بأنك قد قرأت، وفهمت، ووافقت على الالتزام بشروط الخدمة هذه (الـ \"شروط\")، سواء كنت عضواً مسجلاً في الخدمة أم لا. إذا لم توافق على هذه الشروط، فلا تستخدم الخدمة.",
      "userConductTitle": "2. سلوك المستخدم",
      "userConductContent": "أنت توافق على استخدام الخدمة لأغراض مشروعة فقط وبطريقة لا تنتهك حقوق الآخرين، أو تقيد، أو تمنع استخدام أي شخص آخر للخدمة والتمتع بها. يشمل السلوك المحظور التحرش أو التسبب في ضيق أو إزعاج لأي مستخدم آخر، أو نقل محتوى فاحش أو مسيء، أو تعطيل السير الطبيعي للحوار داخل الخدمة.",
      "intellectualPropertyTitle": "3. الملكية الفكرية",
      "intellectualPropertyContent": "جميع المحتويات والمواد المتاحة على الخدمة، بما في ذلك، على سبيل المثال لا الحصر، النصوص، والرسومات، واسم الموقع، والرمز، والصور، والشعارات هي ملكية فكرية لـ MKTV أو مرخصيها وهي محمية بموجب قوانين حقوق النشر والعلامات التجارية المعمول بها. يحظر تماماً أي استخدام غير لائق، بما في ذلك، على سبيل المثال لا الحصر، استنساخ، أو توزيع، أو عرض، أو نقل أي محتوى على هذا الموقع، ما لم يتم التصريح بذلك خصيصاً من قبل MKTV.",
      "terminationTitle": "4. الإنهاء",
      "terminationContent": "يجوز لنا إنهاء أو تعليق وصولك إلى الخدمة فوراً، دون إشعار مسبق أو مسؤولية، لأي سبب كان، بما في ذلك على سبيل المثال لا الحصر إذا انتهكت الشروط. عند الإنهاء، سيتوقف حقك في استخدام الخدمة فوراً. إذا كنت ترغب في إنهاء حسابك، يمكنك ببساطة التوقف عن استخدام الخدمة."
    },
    "privacyPolicy": {
      "title": "سياسة الخصوصية",
      "description": "خصوصيتك تهمنا في المقام الأول. توضح سياسة الخصوصية هذه كيفية جمعنا للمعلومات المتعلقة بك، واستخدامها، والكشف عنها، وحقوقك فيما يتعلق بهذه المعلومات.",
      "informationCollectionTitle": "1. المعلومات التي نجمعها",
      "informationCollectionContent": "نقوم بجمع أنواع مختلفة من المعلومات المتعلقة بالخدمات التي نقدمها، بما في ذلك المعلومات الشخصية التي تقدمها لنا مباشرة (على سبيل المثال، عند إنشاء حساب، أو إجراء عملية شراء، أو الاتصال بدعم العملاء)، والمعلومات التي يتم جمعها تلقائياً من خلال استخدامك للخدمة (على سبيل المثال، بيانات الاستخدام، ومعلومات الجهاز، وملفات تعريف الارتباط).",
      "howWeUseTitle": "2. كيف نستخدم معلوماتك",
      "howWeUseContent": "نستخدم المعلومات التي نجمعها لتقديم خدماتنا وصيانتها وتحسينها، ولتطوير ميزات جديدة، ولتخصيص تجربتك، وللتواصل معك بشأن حسابك وخدماتنا، وللكشف عن المشكلات التقنية أو الاحتيال أو الأنشطة غير القانونية ومنعها ومعالجتها.",
      "sharingInfoTitle": "3. مشاركة معلوماتك",
      "sharingInfoContent": "قد نشارك معلوماتك مع أطراف ثالثة في ظروف معينة، مثل مزودي الخدمة الذين يؤدون وظائف نيابة عنا، فيما يتعلق بتحويلات الأعمال (على سبيل المثال، عمليات الاندماج أو الاستحواذ)، للامتثال للالتزامات القانونية، أو لحماية حقوقنا وممتلكاتنا. نحن لا نبيع معلوماتك الشخصية.",
      "yourChoicesTitle": "4. خياراتك وحقوقك",
      "yourChoicesContent": "لديك خيارات معينة فيما يتعلق بالمعلومات التي نجمعها وكيفية استخدامها. يتضمن ذلك القدرة على الوصول إلى معلوماتك الشخصية أو تحديثها أو حذفها، بالإضافة إلى إلغاء الاشتراك في جمع بيانات معينة أو اتصالات تسويقية. قد يكون لديك أيضاً حقوق إضافية اعتماداً على ولايتك القضائية، مثل الحق في نقل البيانات."
    }
  }
} 